Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON LATAM_+99 Reinforced Wooden Stick.tmx
Source language: en
Languages: es_419

source: I was swept up in the trials and tribulations of being a working member of society.
es_419: Me perdí en las vicisitudes de ser un miembro productivo de la sociedad.

source: huff!
es_419: ¡Juff!

source: is...
es_419: ¿Ese…

source: ...the one to eliminate all humans...
es_419: … quien elimine a todos los humanos.

source: a hacker? what a loser!
es_419: ¿Un hacker? ¡Qué perdedor!

source: it’s abracadabra!
es_419: ¡Es Abracadabra!

source: I forgot all about him.
es_419: Me había olvidado de él.

source: at the young age of five, she had already made her debut into the music scene.
es_419: Con tan solo 5 años, ya había debutado en la escena musical.

source: be careful!
es_419: ¡Tenga cuidado!

source: ...item reinforcement.
es_419: … es mejorar un objeto.

source: your boundless greed will be the very thing to send you to your end.
es_419: … tu codicia desmedida será tu perdición.

source: d{j}i{j}n{j}g
es_419: PLIN

source: luv just turned level 20. how are they all getting beat up by her?
es_419: Amor acaba de llegar al nivel 20. ¿Cómo es que ninguno puede ganarle?

source: "ruining his future"?
es_419: ¿”Arruinó su futuro”?

source: killing other players is way different from having your character deleted.
es_419: Matar a otros personajes es muy distinto a que te borren el personaje.

source: my character got deleted! the staff hasn’t answered me yet! what the hell?!
es_419: ¡Borraron mi personaje! ¡Los desarrolladores aún no me responden! ¡¿Qué rayos?!

source: those guys left earlier.
es_419: Esos tipos se fueron hace rato.

source: +99{j}episode 3. 1 vs.{j}3,000,000
es_419: Episodio 3: 1 vs. 3 000 000

source: do you want to stay a noob forever?!
es_419: ¡¿Quieres ser un novato toda la vida?!

source: what are you talking about?
es_419: ¿De qué hablas?

source: hehehehehehehehe.
es_419: Je, je, je, je, je, je, je.

source: it refers to old men who play the game, "linnage".
es_419: Se refiere a gente grande que juega al "Linnage".

source: maybe I need to work more hours at the convenience store.
es_419: Quizá deba trabajar más horas en la tienda.

source: n-now you know why I tried to stop you, right?
es_419: A-ahora entiende por qué quise detenerlo, ¿no?

source: you were flying around the entire map at first, dodging all of my attacks.
es_419: Al principio, volabas por todo el mapa y esquivabas todos mis ataques.

source: the brave warrior called her captain, though.
es_419: El valiente guerrero la llamó “capitana”.

source: people still share desserts with their neighbors nowadays?
es_419: ¿La gente sigue obsequiando postres a los vecinos, hoy en día?

source: damn...
es_419: Rayos.

source: ha{j}is that him?
es_419: ¿Será él?

source: this is a pretty nice weapon you got.
es_419: Qué buena arma tienes.

source: I’m not particularly handsome or tall.
es_419: No soy precisamente lindo ni alto.

source: not in my wildest dreams did I think he’d put all of his points into that stat.
es_419: Ni en mis sueños más locos pensé que pondría todos sus puntos en esa habilidad.

source: when all you’re going to do is cover it up with the kimchi sauce?!
es_419: si vas a matarle el gusto con salsa de kimchi?!

source: now then...
es_419: Bueno…

source: h-how are they doing that?
es_419: ¿C-cómo hacen eso?

source: you brought this upon yourselves.
es_419: Ustedes se buscaron esto.

source: me too.
es_419: Yo también.

source: I finally killed 1000 people!
es_419: ¡Por fin maté a 1000 jugadores!

source: hello, everyone!
es_419: ¡Hola a todos!

source: come at me.
es_419: Vengan.

source: I almost blew my cover just now.
es_419: Casi arruino mi fachada.

source: my... my...
es_419: Mi… mi…

source: that’s the fun of it all.
es_419: Ese es el chiste.

source: thanks to the protection of the law, sarang was finally free from her parents.
es_419: Gracias a la protección de la ley, Sarang por fin se liberó de sus padres.

source: ...I still need more!
es_419: … ¡aún necesito más!

source: he told me he’d be right back. and now the sun’s already setting!
es_419: Dijo que volvía enseguida, ¡y ya está anocheciendo!

source: welcome to my home!
es_419: ¡Bienvenido a mi casa!

source: her weapon alone is worth about ten million gold.
es_419: Solo su arma vale unos diez millones en oro.

source: what’s th--
es_419: ¿Qué es…?

source: I’ll go and change! jeez!
es_419: ¡Iré a cambiarme! ¡Cielos!

source: you’re dead!
es_419: ¡Estás muerto!

source: who cares if they find out it’s me?
es_419: ¿Qué importa si saben que soy yo?

source: I know, right?
es_419: Sí, ¿no?

source: p-please listen to what I have to say!
es_419: P-por favor, ¡escuche lo que tengo que decir!

source: chatter
es_419: BLA BLA

source: eliminated.
es_419: Eliminado.

source: yes
es_419: Sí

source: =100 million won
es_419: = 100 millones de wones

source: if you don’t have a reason to meet with me, I’ll be logging out.
es_419: Si no tienen una razón para estar aquí, me desconectaré.

source: that’s because these knuckles cost over 10 million gold.
es_419: Estas manoplas cuestan más de 10 millones en oro.

source: arrogant human!
es_419: ¡Humano arrogante!

source: and no matter how strong you become...
es_419: ni lo fuerte que te vuelvas…

source: I knew it.
es_419: Lo sabía.

source: ...a new guiness world record was made in the category of virtual reality games.
es_419: … se rompió un récord Guinness en la categoría de juegos de realidad virtual.

source: ...hah.
es_419: … ja.

source: you want me to f*ck you up or what?!
es_419: ¡¿Quieres que te rompa el c*lo o qué?!

source: my character nam--
es_419: Mi personaje se lla…

source: ...I knew it.
es_419: … Lo sabía.

source: how much money did you burn through to do that?
es_419: ¿Cuánto dinero malgastaste para hacer todo eso?

source: all right, then.
es_419: Muy bien.

source: it was an informative lecture that threw in some humor to please the audience.
es_419: Fue una charla informativa que incluyó algo de humor para divertir al público.

source: they said it’s not a bug nor a hack.
es_419: Dijeron que no hubo ninguna falla ni se usó ningún truco.

source: wait, then as the ceo of chrono life, what do you want with me?!
es_419: Espera, si eres el CEO de Chrono Life, ¡¿qué quieres conmigo?!

source: phew.
es_419: Fiu.

source: I’m a god.
es_419: Soy un dios.

source: did your little minions get scared and run away?!
es_419: ¡¿Tus secuaces se asustaron y huyeron?!

source: don’t just go all-in and attack him!
es_419: ¡No se lance a atacarlo!

source: [current time] 7:34 pm
es_419: [Hora actual] 19:34

source: creak
es_419: CRIIC

source: prepare for the next invocation!
es_419: ¡Prepárense para la nueva invocación!

source: ...had been slain.
es_419: … había sido aniquilada.

source: your boss is here. now bow down!
es_419: Ya llegó tu ama. ¡Arrodíllate!

source: ooh, you scared me there.
es_419: Ay, me asustaste.

source: h{j}y{j}a{j}a{j}a{j}a{j}a{j}a{j}a{j}a{j}a{j}a{j}a{j}a{j}a{j}a{j}a{j}a{j}a{j}a{j}a{j}a{j}a{j}a{j}a{j}a{j}h
es_419: KIAAAAAAAAAAAAAAAAAAA

source: even if he were to find a hundred dollar bill on the floor on his way to work...
es_419: Aunque encontrara un billete de cien dólares tirado en el piso camino al trabajo…

source: the soul of the [knuckle] has entered your body.
es_419: El alma de [la manopla] ha entrado en tu cuerpo.

source: agh!
es_419: ¡Aah!

source: ...what on earth is going on?
es_419: ¿Qué rayos está pasando?

source: ...what are you all waiting for?
es_419: … ¿qué están esperando?

source: oh, gosh.
es_419: Ay, cielos.

source: what’s the problem here?
es_419: ¿Cuál es el problema?

source: sarang han 5 years old
es_419: Sarang Han 5 años

source: poof
es_419: PUUF

source: now cut that out.
es_419: Termínala ya.

source: if you don’t want to, you can always push back the shoot again.
es_419: Si no quieres ir, podemos retrasar la sesión de fotos otra vez.

source: yo{j}hahahaha
es_419: Ja, ja, ja, ja, ja

source: most powerful mage of the royal family, abracadabra
es_419: Abracadabra, la maga más poderosa de la familia real

source: we sold it all to make this statue!
es_419: ¡Vendimos todo para hacer esta estatua!

source: little bunny foo foo!
es_419: El conejito Fufú…

source: the souls of all weapons have successfully entered your body.
es_419: Las almas de todas las armas han entrado con éxito a tu cuerpo.

source: she’s pretty good.
es_419: Es muy buena.

source: are you finally going to give up now?
es_419: ¿Te rindes finalmente?

source: feelings of sympathy?
es_419: ¿Sentí empatía?

source: good question.
es_419: Buena pregunta.

source: that’s the elite guild of crusaders with only ten members.
es_419: Es el gremio de élite de los cruzados, que solo tiene diez miembros.

source: bullseye.
es_419: En el blanco.

source: wh-what are you saying?!
es_419: ¡¿D-de qué está hablando?!

source: we’re in the fields near the dungeon.
es_419: Estamos en los prados cerca de la mazmorra.

source: you don’t know what you’re in for.
es_419: No sabes en qué te estás metiendo.

source: I wonder what she does for a living in real life.
es_419: Me pregunto a qué se dedicará en la vida real.

source: never mind.
es_419: Olvídalo.

source: yes, ma’am.
es_419: Sí, ama.

source: but doesn’t she look somewhat familiar?
es_419: Pero ¿no se te hace conocida?

source: your next feast, huh?
es_419: Tu próximo banquete, ¿eh?

source: now I’m a [goddess of life].
es_419: Ahora soy una [Diosa de la vida].

source: from this point on, have everyone monitor only two specific characters.
es_419: A partir de este momento, quiero que todos vigilen solo a dos personajes.

source: lie to me...
es_419: a mentirme…

source: west forest the hidden tower
es_419: Bosque occidental La torre escondida

source: so you’re up first, huh, birdbrains?
es_419: Así que tú primero, ¿eh, pájaro descerebrado?

source: I have no idea who she is.
es_419: No tengo idea de quién es.

source: next episode.
es_419: Próximo episodio:

source: is that what it looks like?
es_419: ¿Eso es lo que parece?

source: enjoy the true chrono life experience.
es_419: Vive la verdadera experiencia de Chrono Life.

source: and the place that sarang headed straight for was...
es_419: Y fue directo hacia…

source: I just moved in next door!
es_419: ¡Acabo de mudarme al lado!

source: if that’s the case, I can definitely help you out with that!
es_419: ¡Si es así, sin duda puedo ayudarlo!

source: sigh.
es_419: Uff…

source: my other head?
es_419: ¿Mi otra cabeza?

source: ha{j}ha{j}ha{j}ha{j}ha
es_419: Ja ja ja ja ja

source: just give up.
es_419: Ríndete de una vez.

source: blech...
es_419: Bleh…

source: spit
es_419: PFFF

source: character modeler
es_419: DISEÑADOR DE PERSONAJES

source: isn’t that right...{j}isn’t that right...
es_419: ¿No es así…

source: looks like front village is now a ghost town.
es_419: Parece que la aldea Front ahora es un pueblo fantasma.

source: I’m so sorry, sarang.
es_419: Lo siento mucho, Sarang.

source: you know I get anxious when I don’t have them on.
es_419: Sabes que me da ansiedad no tenerlos puestos.

source: [urus] soul has entered your weapon.
es_419: [Urus] ha transferido su alma a tu arma.

source: ...and turned that into cash?!
es_419: … y lo convierto en dinero?!

source: everyone,
es_419: Díganme,

source: I’ve gotten a lot more patient after going through so much recently.
es_419: Me volví mucho más paciente después de todo lo que pasé últimamente.

source: should I just flee the country?
es_419: ¿Debería huir a otro país?

source: h{j}y{j}a{j}a{j}a
es_419: ¡Aaaah!

source: slurp
es_419: SLURB

source: that’s funny.
es_419: Qué gracioso.

source: I didn’t plan on knocking her out like that.
es_419: No era mi intención dejarla inconsciente.

source: why’d he show up if he was just going to disappear anyway?
es_419: ¿Para qué apareció si se iba a ir así?

source: what’s this?
es_419: ¿Y esto?

source: the knuckles of silence?
es_419: ¿Las Manoplas del Silencio?

source: on this day, hawkeye was a witness.
es_419: Ese día, Hawkeye fue testigo.

source: if you would let it happen,
es_419: Si pudieras hacerlo,

source: I’ve only got one strike left.
es_419: Me queda un solo golpe.

source: it was nothing, really.
es_419: No fue nada, en serio.

source: total number of members summoned:
es_419: Cantidad total de miembros convocados:

source: undies...
es_419: Calzón…

source: all of the high-ranking players say...
es_419: Los mejores jugadores dicen…

source: pleased to meet you.
es_419: Encantada de conocerte.

source: swing
es_419: ZAS

source: who said I wanted to even do that to begin with?!
es_419: ¡¿Quién dijo que yo quería hacer eso siquiera?!

source: 17 years old.
es_419: De 17 años.

source: kill...
es_419: a matar…

source: f*ck off, noob.
es_419: Vete a la m*erda, novato.

source: hey, noob!
es_419: ¡Hola, novato!

source: what should I buy now?
es_419: ¿Qué compro ahora?

source: damn!
es_419: ¡Cielos!

source: skill activated.
es_419: Habilidad activada.

source: did you see a black-haired girl anywhere around here?
es_419: ¿Viste a una chica de pelo oscuro por aquí?

source: it’s that prick!!!
es_419: ¡¡¡Es ese imbécil!!!

source: but it’ll be on my terms.
es_419: Pero será como yo lo crea mejor.

source: come again!
es_419: ¡Vuelve pronto!

source: the sun sets over these vast plains.
es_419: El sol se oculta sobre estas vastas llanuras.

source: this was the first time...
es_419: Esta era la primera vez…

source: nothing.
es_419: Nada.

source: oh, wait.
es_419: Un momento.

source: I doubt he has anything worth taking.
es_419: Dudo que tenga algo de valor.

source: don’t go to front village. your character’s gonna get deleted.
es_419: No vayan a la aldea Front. Les borrarán su personaje.

source: why are you suddenly trying to act all cool?
es_419: ¿Por qué de repente tratas de hacerte el interesante?

source: h{j}y{j}a{j}a{j}a{j}a{j}a{j}a
es_419: KIAAAAAAAA

source: you’re pretty popular, huh?
es_419: Es muy popular, ¿no?

source: Staff Jaehyun leeㆍRock leeㆍBobaccari KongsunaㆍWallaby
es_419: Equipo: Jaehyun leeㆍRock leeㆍBobaccari KongsunaㆍWallaby

source: I’ll be outside and leave you all to catch up.
es_419: Estaré afuera, dejaré que se pongan al día.

source: this is really strange.
es_419: Esto es muy extraño.

source: ...to lying.
es_419: … a las mentiras.

source: it took a lot of energy to hold back my powers.
es_419: Me costó mucho contener mis poderes.

source: take your time to enjoy the game instead.
es_419: En lugar de eso, dedícate a disfrutar el juego.

source: h{j}h{j}h{j}a{j}h{j}h{j}h{j}h{j}h{j}h{j}h{j}h{j}h{j}h{j}h{j}h{j}h{j}h{j}h{j}h{j}h{j}h{j}h{j}h{j}h{j}h{j}h{j}h{j}h{j}h{j}h{j}h{j}h{j}h{j}h{j}h
es_419: Aaaaaaaaaaaaaaaaaaaaaaaaaah

source: there’s just someone who would like to meet you, ms. han.
es_419: Hay alguien que quiere verla, señorita Han.

source: and what's this "fragment of god" you mentioned?
es_419: ¿Y qué es eso que dijiste del “fragmento de Dios”?

source: ...were just [normal attacks].
es_419: … fueron solo [ataques normales].

source: either way, you’d be gone.
es_419: De cualquier forma, desaparecerías.

source: ugh...
es_419: ¡Agh!

source: he’s over here!
es_419: ¡Aquí está!

source: you’re a pro, right?!
es_419: Eres una pro, ¡¿no?!

source: ahh.
es_419: Aah.

source: then how about...
es_419: Entonces, ¿qué te parece…

source: you could’ve at least changed up your hairstyle!
es_419: ¡Al menos hubieras cambiado tu peinado!

source: it’s a special end-of-the-year live broadcast!
es_419: ¡Es un evento especial de fin de año en directo!

source: ...your hair looks different.
es_419: … tu pelo luce diferente.

source: gamer communities all over were discussing this event amongst themselves.
es_419: Comunidades de jugadores de todo el mundo discutían el acontecimiento entre ellos.

source: we heard that you’ve been cast for a pretty entertaining role for a new drama!
es_419: ¡Nos enteramos de que te eligieron para un papel bastante entretenido en una serie nueva!

source: look, it’s hawkeye.
es_419: Miren, es Hawkeye.

source: "cross line"!
es_419: ¡Cruzada Roja!

source: viewers:{j}34,969
es_419: Espectadores:{j}34 969

source: at this rate, we’re all going to disappear into dus--
es_419: Si esto sigue así, terminaremos hechos pol…

source: but most importantly, this incident has caused the userbase to doubt the credibility of our company’s practices, leading to a fall in our stocks.
es_419: Pero lo más grave es que este incidente ha hecho que los usuarios duden de la credibilidad de la empresa, lo que provocó la caída de nuestras acciones.

source: I’m sure it’ll break soon.
es_419: En cualquier momento se rompe.

source: a fragment of god?
es_419: ¿Un fragmento de Dios?

source: strike the enemy multiple times. basic swordsman skill
es_419: Golpea al enemigo muchas veces. Habilidad básica de espadachín

source: this "knight's two-handed sword" came with the package.
es_419: Este “mandoble de caballero” venía en ese paquete.

source: flame...
es_419: ¡Proyectil…

source: pinch
es_419: TAC

source: does that mean you’re...
es_419: ¿Eso quiere decir que eres…?

source: could you find it in your heart...
es_419: ¿Crees que podrás…

source: get them.
es_419: Vayan por ellos.

source: how dare a mere human like you try to take ownership of me.
es_419: ¿Cómo se atreve una simple humana como tú a tratar de adueñarse de mí?

source: Staff KongsunaㆍWallabyㆍJaehyun Lee
es_419: Equipo: KongsunaㆍWallabyㆍJaehyun Lee

source: that’s equal to ten million won in real life!
es_419: ¡Eso equivale a diez millones de wones en la vida real!

source: hey, captain luv!
es_419: ¡Hola, capitana Amor!

source: I honestly want to bash your skull in right this instant. but since we’re already talking...
es_419: Sinceramente, quiero partirte la cabeza en este instante, pero ya que estamos hablando…

source: f*ck...
es_419: M*erda…

source: they basically dug their own graves.
es_419: Cavaron su propia tumba.

source: it’s... alive!
es_419: Está… ¡vivo!

source: the same kind? you mean, a weak loser?
es_419: ¿Mismo tipo? Es decir, ¿un patético perdedor?

source: I will be...
es_419: … seré…

source: this is the last step of your journey with me.
es_419: Este es el último paso en tu trayecto conmigo.

source: I bought the "55,000 won beginner warrior package".
es_419: Compré el “Paquete de guerrero principiante” de 55 000 wones.

source: is there anything going on in that pea brain of yours?!
es_419: ¡¿Qué te pasa por esa cabeza de chorlito que tienes?!

source: are you after my weapon?
es_419: ¿Quieres mi arma?

source: ...but undies somehow got them back for me.
es_419: … pero, de algún modo, Calzón las recuperó.

source: anyway, I wonder how much gold those ascended weapons go for.
es_419: En fin, me pregunto cuánto oro valdrán esas armas ascendidas.

source: I finally got my revenge!
es_419: ¡Por fin pude vengarme!

source: clink
es_419: CLINC

source: god of classes
es_419: Dios de las clases

source: 88{j}let’s do this!
es_419: ¡Acábalo!

source: oh, gosh. my apologies.
es_419: Ay, cielos. Mil disculpas.

source: I hit it without killing it!
es_419: ¡Le pegué pero sin matarlo!

source: "bound to fail"?
es_419: ¿”Condenado a fracasar”?

source: but that happiness was trampled all over and tarnished by greedy adults.
es_419: Pero esa felicidad fue pisoteada y empañada por adultos codiciosos.

source: whoohoo!
es_419: ¡Yuujuuuu!

source: don’t you know you have to stay in your position for party battles?!
es_419: ¡¿No sabes que debes mantener tu posición en las batallas grupales?!

source: you don’t have the right to possess a fragment of god.
es_419: No tienes derecho a poseer un fragmento de Dios.

source: be careful.
es_419: Tenga cuidado.

source: I guess that means I’ve been coming here for 15 years now.
es_419: Eso significa que llevo 15 años viniendo aquí.

source: this superstar has a hobby that the public has no idea about.
es_419: Esta superestrella tiene un pasatiempo que el público no conoce…

source: ...who shot me with that arrow earlier.
es_419: … el que me disparó una flecha hace un rato.

source: episode 12. how I went from convenience store clerk to millionaire (2)
es_419: Episodio 12: Cómo pasé de empleado de tienda a millonario (2)

source: I learned that in this game...
es_419: Aprendí que en este juego…

source: welcome to your new journey!
es_419: ¡Bienvenido a tu nueva aventura!

source: her own parents.
es_419: sus propios padres.

source: all members of the [hallasan guild] have been slain.
es_419: Todos los miembros de [el Gremio de Hallasan] han sido aniquilados.

source: these are users who possess the highest ranks across the world.
es_419: Se trata de usuarios que poseen los rangos más altos en todo el mundo.

source: now make the right choi--
es_419: Ahora, elige bi…

source: I said, you’ll never be able to kill m--
es_419: Dije que jamás podrás matar…

source: eight mirrors?
es_419: ¿Ocho espejos?

source: hey.
es_419: Oye.

source: are you going through puberty or something?
es_419: ¿Acaso llegaste a la pubertad o algo así?

source: episode. character deleted -end-
es_419: Episodio 16: Personaje eliminado -Fin-

source: aside from your music career, you’re also famous for your career as an actress.
es_419: Además de tener tu carrera musical, también eres famosa por tu carrera como actriz.

source: chakram of the ascended
es_419: Chakram de los Ascendidos.

source: shouldn’t that job class be called the goddess of death?
es_419: ¿Esa clase no debería llamarse Diosa de la muerte?

source: h-he cracked my magic crest!
es_419: ¡R-rompió mi sello mágico!

source: his position in chrono life was unrivaled.
es_419: No había nadie más notorio que él en Chrono Life.

source: li{j}loooooser
es_419: Perdedoooor

source: yes, sir.
es_419: Sí, señor.

source: I guess I’ll help you out this time.
es_419: Creo que esta vez te ayudaré,

source: ...this isn’t half bad.
es_419: … esto no está tan mal.

source: this is pretty hilarious.
es_419: Esto es muy gracioso.

source: ugh, I can’t stand it when you do that!
es_419: Agh, ¡no soporto cuando haces eso!

source: my knuckles!
es_419: ¡Mis manoplas!

source: luv
es_419: Amor

source: let’s go!
es_419: ¡Vamos!

source: first in user satisfaction.
es_419: Primero en satisfacción del usuario.

source: I’m hawkeye...
es_419: Soy Hawkeye…

source: ...sarang was still completely broken on the inside.
es_419: … aún estaba completamente destruida por dentro.

source: I guess I won’t be farming today.
es_419: Supongo que no juntaré objetos hoy.

source: they say bad guys always get their karma in the end.
es_419: Dicen que al final a los malos siempre les llega el karma.

source: ...she is now the most famous idol,
es_419: … ahora es la estrella más famosa,

source: most powerful player?
es_419: ¿El jugador más poderoso?

source: ...and taking your time to enjoy the game instead?
es_419: … y, en lugar de eso, te dedicas a disfrutar el juego?

source: I’m the main character...
es_419: Soy el personaje principal…

source: tune in to my livestream if you’ve had your character deleted!
es_419: ¡Entren a mi stream en vivo si les borraron su personaje!

source: why are you following me?!
es_419: ¡¿Por qué me estás siguiendo?!

source: are you rich or something?
es_419: ¿Eres rica o algo así?

source: durability:{j}3/5
es_419: {j}Durabilidad: 3/5

source: the ravine of the deceased.
es_419: El Valle de los Muertos…

source: bb{j}ew
es_419: Puaj.

source: I summon all guild members of the world guild alliance!
es_419: ¡Invoco a todos los miembros de la alianza mundial de gremios!

source: slip
es_419: ZIP

source: it’s the first time the top five guilds have ever banded together!
es_419: ¡Es la primera vez que los cinco mejores gremios se unen!
